# ModifierType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LayerModifier..::..ModifierType Property
LayerModifier Class See Also
---
The modifier type of LayerModifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ModifierType ModifierType { get; set; }
```

Visual Basic
---
```text
Public Property ModifierType As ModifierType
	Get
	Set
```

Visual C++
---
```text
public:
property ModifierType ModifierType {
	ModifierType get ();
	void set (ModifierType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
LayerModifier Class
Autodesk.Revit.DB Namespace